# **Pandas 13 - Konversi nilai numerik ke dalam kategori pada Data Frame**

### Import Modules

In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.0
1.24.2

### Persiapan Data Frame

In [3]:
n_rows = 10
n_cols = 1
cols = ('usia',)

df = pd.DataFrame(np.random.randint(1, 99, size=(n_rows, n_cols)), 
                  columns=cols)
df

   usia
0    88
1    32
2    19
3    16
4    26
5    77
6    15
7    53
8    69
9    78

### Pengelompokkan nilai numerik ke dalam beberapa kategori menggunakan cut()

In [4]:
# Menggunakan metode cut dari pandas untuk membuat kolom 'kelompok_usia' berdasarkan kolom 'usia' dalam data frame
# Parameter bins digunakan untuk menentukan batas kelompok usia dalam bentuk list
# Parameter labels digunakan untuk memberikan label pada masing-masing kelompok usia
df['kelompok_usia'] = pd.cut(df['usia'], 
                             bins=[0, 18, 65, 99], 
                             labels=['anak', 'dewasa', 'manula'])

# Menampilkan data frame dengan tambahan kolom 'kelompok_usia'
df

   usia kelompok_usia
0    88        manula
1    32        dewasa
2    19        dewasa
3    16          anak
4    26        dewasa
5    77        manula
6    15          anak
7    53        dewasa
8    69        manula
9    78        manula